nehalem501/mke04z/drivers/fsl_clock.h
/*
 * The Clear BSD License
 * Copyright (c) 2015, Freescale Semiconductor, Inc.
 * Copyright (c) 2016 - 2017 , NXP
 * All rights reserved.
 *
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 * that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _FSL_CLOCK_H_
#define _FSL_CLOCK_H_

#include "fsl_common.h"

/*! @addtogroup clock */
/*! @{ */

/*! @file */

/*******************************************************************************
 * Configurations
 ******************************************************************************/

/*! @brief Configures whether to check a parameter in a function.
 *
 * Some ICS settings must be changed with conditions, for example:
 *  1. ICSIRCLK settings, such as the source, divider, and the trim value should not change when
 *     ICSIRCLK is used as a system clock source.
 *  2. ICS_C7[OSCSEL] should not be changed  when the external reference clock is used
 *     as a system clock source. For example, in FBE/BELP/PBE modes.
 *  3. The users should only switch between the supported clock modes.
 *
 * ICS functions check the parameter and ICS status before setting, if not allowed
 * to change, the functions return error. The parameter checking increases code size,
 * if code size is a critical requirement, change #ICS_CONFIG_CHECK_PARAM to 0 to
 * disable parameter checking.
 */
#ifndef ICS_CONFIG_CHECK_PARAM
#define ICS_CONFIG_CHECK_PARAM 0U
#endif

/*! @brief Configure whether driver controls clock
 *
 * When set to 0, peripheral drivers will enable clock in initialize function
 * and disable clock in de-initialize function. When set to 1, peripheral
 * driver will not control the clock, application could contol the clock out of
 * the driver.
 *
 * @note All drivers share this feature switcher. If it is set to 1, application
 * should handle clock enable and disable for all drivers.
 */
#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL))
#define FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL 0
#endif

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief CLOCK driver version 2.0.3. */
#define FSL_CLOCK_DRIVER_VERSION (MAKE_VERSION(2, 0, 3))
/*@}*/

/*! @brief External XTAL0 (OSC0) clock frequency.
 *
 * The XTAL0/EXTAL0 (OSC0) clock frequency in Hz. When the clock is set up, use the
 * function CLOCK_SetXtal0Freq to set the value in the clock driver. For example,
 * if XTAL0 is 8 MHz:
 * @code
 * CLOCK_InitOsc0(...); // Set up the OSC0
 * CLOCK_SetXtal0Freq(80000000); // Set the XTAL0 value to the clock driver.
 * @endcode
 *
 * This is important for the multicore platforms where only one core needs to set up the
 * OSC0 using the CLOCK_InitOsc0. All other cores need to call the CLOCK_SetXtal0Freq
 * to get a valid clock frequency.
 */
extern uint32_t g_xtal0Freq;

#if (defined(OSC) && !(defined(OSC0)))
#define OSC0 OSC
#endif

/*! @brief Clock ip name array for UART. */
#define UART_CLOCKS  \
    {                \
        kCLOCK_Uart0 \
    }

/*! @brief Clock ip name array for ADC16. */
#define ADC_CLOCKS  \
    {               \
        kCLOCK_Adc0 \
    }

/*! @brief Clock ip name array for IRQ. */
#define IRQ_CLOCKS  \
    {               \
        kCLOCK_Irq0 \
    }

/*! @brief Clock ip name array for KBI. */
#define KBI_CLOCKS               \
    {                            \
        kCLOCK_Kbi0, kCLOCK_Kbi1 \
    }

/*! @brief Clock ip name array for SPI. */
#define SPI_CLOCKS  \
    {               \
        kCLOCK_Spi0 \
    }

/*! @brief Clock ip name array for I2C. */
#define I2C_CLOCKS  \
    {               \
        kCLOCK_I2c0 \
    }

/*! @brief Clock ip name array for FTM. */
#define FTM_CLOCKS               \
    {                            \
        kCLOCK_Ftm0, kCLOCK_IpInvalid, kCLOCK_Ftm2 \
    }

/*! @brief Clock ip name array for CMP. */
#define ACMP_CLOCKS                \
    {                              \
        kCLOCK_Acmp0, kCLOCK_Acmp1 \
    }

/*! @brief Clock ip name array for CRC. */
#define CRC_CLOCKS   \
    {                \
        kCLOCK_Crc0, \
    }

/*! @brief Clock ip name array for PWT. */
#define PWT_CLOCKS   \
    {                \
        kCLOCK_Pwt0, \
    }

/*! @brief Clock ip name array for PIT. */
#define PIT_CLOCKS   \
    {                \
        kCLOCK_Pit0, \
    }

/*! @brief Clock ip name array for RTC. */
#define RTC_CLOCKS   \
    {                \
        kCLOCK_Rtc0, \
    }

/*!
 * @brief LPO clock frequency.
 */
#define LPO_CLK_FREQ 1000U

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{

    /* ----------------------------- System layer clock -------------------------------*/
    kCLOCK_CoreSysClk, /*!< Core/system clock                                         */
    kCLOCK_PlatClk,    /*!< Platform clock                                            */
    kCLOCK_BusClk,     /*!< Bus clock                                                 */
    kCLOCK_FlashClk,   /*!< Flash clock                                               */

