nehalem501/mke04z/drivers/fsl_clock.h
    /* ---------------------------------- OSC clock -----------------------------------*/
    kCLOCK_Osc0ErClk, /*!< OSC0 external reference clock (OSC0ERCLK)                 */

    /* ----------------------------- ICS and ICS-Lite clock ---------------------------*/
    kCLOCK_ICSFixedFreqClk,   /*!< ICS fixed frequency clock (ICSFFCLK)                      */
    kCLOCK_ICSInternalRefClk, /*!< ICS internal reference clock (ICSIRCLK)                   */
    kCLOCK_ICSFllClk,         /*!< ICSFLLCLK                                                 */
    kCLOCK_ICSOutClk,         /*!< ICS Output clock                                          */

    /* --------------------------------- Timer(FTM/PWT) clock ----------------------------------*/
    kCLOCK_TimerClk, /*!< TIMER clock for FTM and PWT */

    /* --------------------------------- Other clock ----------------------------------*/
    kCLOCK_LpoClk, /*!< LPO clock                                                 */

} clock_name_t;

/*------------------------------------------------------------------------------

 clock_gate_t definition:

 31                              16                              0
 -----------------------------------------------------------------
 | SIM_SCGC register offset       |   control bit offset in SCGC |
 -----------------------------------------------------------------

 For example, the SDHC clock gate is controlled by SIM_SCGC3[17], the
 SIM_SCGC3 offset in SIM is 0x1030, then kCLOCK_GateSdhc0 is defined as

              kCLOCK_GateSdhc0 = (0x1030 << 16) | 17;

------------------------------------------------------------------------------*/

#define CLK_GATE_REG_OFFSET_SHIFT 16U
#define CLK_GATE_REG_OFFSET_MASK 0xFFFF0000U
#define CLK_GATE_BIT_SHIFT_SHIFT 0U
#define CLK_GATE_BIT_SHIFT_MASK 0x0000FFFFU

#define CLK_GATE_DEFINE(reg_offset, bit_shift)                                  \
    ((((reg_offset) << CLK_GATE_REG_OFFSET_SHIFT) & CLK_GATE_REG_OFFSET_MASK) | \
     (((bit_shift) << CLK_GATE_BIT_SHIFT_SHIFT) & CLK_GATE_BIT_SHIFT_MASK))

#define CLK_GATE_ABSTRACT_REG_OFFSET(x) (((x)&CLK_GATE_REG_OFFSET_MASK) >> CLK_GATE_REG_OFFSET_SHIFT)
#define CLK_GATE_ABSTRACT_BITS_SHIFT(x) (((x)&CLK_GATE_BIT_SHIFT_MASK) >> CLK_GATE_BIT_SHIFT_SHIFT)

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
typedef enum _clock_ip_name
{
    kCLOCK_IpInvalid = 0U,

    kCLOCK_I2c0 = CLK_GATE_DEFINE(0xCU, 17U),
    kCLOCK_Uart0 = CLK_GATE_DEFINE(0xCU, 20U),
    kCLOCK_Acmp0 = CLK_GATE_DEFINE(0xCU, 30U),
    kCLOCK_Acmp1 = CLK_GATE_DEFINE(0xCU, 31U),
    kCLOCK_Spi0 = CLK_GATE_DEFINE(0xCU, 18U),
    kCLOCK_Irq0 = CLK_GATE_DEFINE(0xCU, 27U),
    kCLOCK_Kbi0 = CLK_GATE_DEFINE(0xCU, 24U),
    kCLOCK_Kbi1 = CLK_GATE_DEFINE(0xCU, 25U),
    kCLOCK_Adc0 = CLK_GATE_DEFINE(0xCU, 29U),
    kCLOCK_Crc0 = CLK_GATE_DEFINE(0xCU, 10U),
    kCLOCK_Ftm0 = CLK_GATE_DEFINE(0xCU, 5U),
    kCLOCK_Ftm2 = CLK_GATE_DEFINE(0xCU, 7U),
    kCLOCK_Pwt0 = CLK_GATE_DEFINE(0xCU, 4U),
    kCLOCK_Pit0 = CLK_GATE_DEFINE(0xCU, 1U),
    kCLOCK_Rtc0 = CLK_GATE_DEFINE(0xCU, 0U),
} clock_ip_name_t;

/*!@brief SIM configuration structure for clock setting. */
typedef struct _sim_clock_config
{
    uint8_t outDiv1;        /*!< OUTDIV1 */
    uint8_t outDiv2;        /*!< OUTDIV2 */
    uint8_t outDiv3;        /*!< OUTDIV3 */

    uint8_t busClkPrescaler; /*!< A option prescaler for bus clock */
} sim_clock_config_t;

/*! @brief OSC work mode. */
enum _osc_work_mode
{
    kOSC_ModeExt = 0U,                                          /*!< OSC source from external clock. */
    kOSC_ModeOscLowPower = OSC_CR_OSCOS_MASK,                   /*!< Oscillator low freq low power. */
    kOSC_ModeOscHighGain = OSC_CR_HGO_MASK | OSC_CR_OSCOS_MASK, /*!< Oscillator low freq high gain. */
};

/*! @brief OSC enable mode. */
enum _osc_enable_mode
{
    kOSC_Enable = OSC_CR_OSCEN_MASK,        /*!< Enable.              */
    kOSC_EnableInStop = OSC_CR_OSCSTEN_MASK /*!< Enable in stop mode. */
};

/*!
 * @brief OSC Initialization Configuration Structure
 *
 * Defines the configuration data structure to initialize the OSC.
 * When porting to a new board, set the following members
 * according to the board setting:
 * 1. freq: The external frequency.
 * 2. workMode: The OSC module mode.
 * 3. enableMode: The OSC enable mode.
 */
typedef struct _osc_config
{
    uint32_t freq;      /*!< External clock frequency.    */
    uint8_t workMode;   /*!< OSC work mode setting.       */
    uint8_t enableMode; /*!< Configuration for OSCERCLK.  */
} osc_config_t;

/*! @brief ICS FLL reference clock source select. */
typedef enum _ics_fll_src
{
    kICS_FllSrcExternal, /*!< External reference clock is selected          */
    kICS_FllSrcInternal  /*!< The slow internal reference clock is selected */
} ics_fll_src_t;

/*! @brief ICSOUT clock source. */
typedef enum _ics_clkout_src
{
    kICS_ClkOutSrcFll,      /*!< Output of the FLL is selected (reset default)  */
    kICS_ClkOutSrcInternal, /*!< Internal reference clock is selected, FLL is bypassed */
    kICS_ClkOutSrcExternal, /*!< External reference clock is selected, FLL is bypassed */
} ics_clkout_src_t;

/*! @brief ICS status. */
enum _ics_status
{
    kStatus_ICS_ModeUnreachable = MAKE_STATUS(kStatusGroup_ICS, 0), /*!< Can't switch to target mode. */
    kStatus_ICS_SourceUsed = MAKE_STATUS(kStatusGroup_ICS, 1)       /*!< Can't change the clock source because
                                                                         it is in use. */
};

/*! @brief ICS internal reference clock (ICSIRCLK) enable mode definition. */
enum _ics_irclk_enable_mode
{
    kICS_IrclkDisable = 0U,                       /*!< ICSIRCLK disable. */
    kICS_IrclkEnable = ICS_C1_IRCLKEN_MASK,       /*!< ICSIRCLK enable.              */
    kICS_IrclkEnableInStop = ICS_C1_IREFSTEN_MASK /*!< ICSIRCLK enable in stop mode. */
};

/*! @brief ICS mode definitions */
typedef enum _ics_mode
{
    kICS_ModeFEI = 0U, /*!< FEI   - FLL Engaged Internal         */
    kICS_ModeFBI,      /*!< FBI   - FLL Bypassed Internal        */
    kICS_ModeBILP,     /*!< BILP  - Bypassed Low Power Internal  */
    kICS_ModeFEE,      /*!< FEE   - FLL Engaged External         */
    kICS_ModeFBE,      /*!< FBE   - FLL Bypassed External        */
    kICS_ModeBELP,     /*!< BELP  - Bypassed Low Power External  */
    kICS_ModeError     /*!< Unknown mode                         */
} ics_mode_t;

/*! @brief ICS configuration structure
 *
 * When porting to a new board, set the following members
 * according to the board setting:
 * 1. icsMode:  ICS mode
 * 2. irClkEnableMode: ICSIRCLK enable mode
 * 3. rDiv: If the FLL uses the external reference clock, set this
 *    value to ensure that the external reference clock divided by rDiv is
 *    in the 31.25 kHz to 39.0625 kHz range.
 * 4. bDiv, this divider determine the ISCOUT clock
 */
typedef struct _ics_config
{
    ics_mode_t icsMode;      /*!< ICS mode.                   */
    uint8_t irClkEnableMode; /*!< ICSIRCLK enable mode.       */
    uint8_t rDiv;            /*!< Divider for external reference clock, ICS_C1[RDIV].    */
    uint8_t bDiv;            /*!< Divider for ICS output clock ICS_C2[BDIV].      */

} ics_config_t;

